<a href="https://colab.research.google.com/github/Bayu142002/Basic-Python-Programming-for-Data-Science./blob/main/Valentino_Bayu_Adi_2015015020_Projek%5BC%5D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [159]:
# Mencari Batas Bawah
x = 0.26667
y = []
while x <= 2:
  x = x + 0.33333
  y.append(x)
print(y)

[0.6000000000000001, 0.9333300000000001, 1.2666600000000001, 1.59999, 1.9333200000000001, 2.2666500000000003]

In [156]:
# Mencari Batas Atas
p = 0.6
q = []
while p < 2.5:
  p = p + 0.33333
  q.append(p)

q[5] = 2.60000
print(q)

[0.93333, 1.26666, 1.59999, 1.9333200000000001, 2.2666500000000003, 2.6]

In [157]:
# Mencari Nilai Tengah
a = np.add(z,q)
b = a/2
b

array([0.766665, 1.099995, 1.433325, 1.766655, 2.099985, 2.433325])

In [160]:
# Buat Menjadi Data Frame
list1 = ["U1","U2","U3","U4","U5","U6"]
dict1 = {"Nama Kelas":list1,"Batas Bawah":y,"Batas Atas":q,"Nilai Tengah":b}
df = pd.DataFrame(dict1)
df

  Nama Kelas  Batas Bawah  Batas Atas  Nilai Tengah
0         U1      0.60000     0.93333      0.766665
1         U2      0.93333     1.26666      1.099995
2         U3      1.26666     1.59999      1.433325
3         U4      1.59999     1.93332      1.766655
4         U5      1.93332     2.26665      2.099985
5         U6      2.26665     2.60000      2.433325